rapid-clojure.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Rapid clojure</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Rapid clojure"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-06-05 19:59:44 CEST"/>
<meta name="author" content="Antoine R. Dumont"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Rapid clojure</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Object</a>
<ul>
<li><a href="#sec-1-1">1.1 Unit of measure: Class</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 What does this mean?</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2 Data as object</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 mutable</a></li>
<li><a href="#sec-1-2-2">1.2.2 Why?</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 Imagine</a>
<ul>
<li><a href="#sec-2-1">2.1 No instanciation of class</a></li>
<li><a href="#sec-2-2">2.2 stateless</a></li>
<li><a href="#sec-2-3">2.3 instant feedback</a></li>
<li><a href="#sec-2-4">2.4 Immutability</a></li>
<li><a href="#sec-2-5">2.5 No encapsulation</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Clojure</a>
<ul>
<li><a href="#sec-3-1">3.1 Unit of measure: function</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1 What does this mean?</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2 Data as Data</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1 a list is a list</a></li>
<li><a href="#sec-3-2-2">3.2.2 if object need be, why not a map?</a></li>
<li><a href="#sec-3-2-3">3.2.3 unicity? set?</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3 oh! and code is data</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Object</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Unit of measure: Class</h3>
<div class="outline-text-3" id="text-1-1">


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> What does this mean?</h4>
<div class="outline-text-4" id="text-1-1-1">

<ul>
<li id="sec-1-1-1-1">Instanciation policy&hellip;<br/>
Framework like guice or spring for dependency injection
</li>
</ul>
<ul>
<li id="sec-1-1-1-2">Stateful code<br/>
</li>
</ul>
<ul>
<li id="sec-1-1-1-3">Design Pattern<br/>
Really?
intertwined?
complect?
anyone?
</li>
</ul>
<ul>
<li id="sec-1-1-1-4">tests<br/>
How do i test:
<ul>
<li>static method?
</li>
<li>stateful method?
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-1-1-1-5">feedback<br/>
To have feedback, tests are mandatory or else&hellip;

<p>
Nightmare/Hell
</p></li>
</ul>
</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Data as object</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> mutable</h4>
<div class="outline-text-4" id="text-1-2-1">

<p>concurrency anyone?
volatile, synchronized, really?
</p></div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Why?</h4>
<div class="outline-text-4" id="text-1-2-2">

<p>state and identity are 2 different things.
why merge it?
</p></div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Imagine</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> No instanciation of class</h3>
<div class="outline-text-3" id="text-2-1">

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> stateless</h3>
<div class="outline-text-3" id="text-2-2">

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> instant feedback</h3>
<div class="outline-text-3" id="text-2-3">

</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Immutability</h3>
<div class="outline-text-3" id="text-2-4">

</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> No encapsulation</h3>
<div class="outline-text-3" id="text-2-5">

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Clojure</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Unit of measure: function</h3>
<div class="outline-text-3" id="text-3-1">


</div>

<div id="outline-container-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> What does this mean?</h4>
<div class="outline-text-4" id="text-3-1-1">

<ul>
<li id="sec-3-1-1-1">no instanciation<br/>
</li>
</ul>
<ul>
<li id="sec-3-1-1-2">stateless<br/>
</li>
</ul>
<ul>
<li id="sec-3-1-1-3">immediate feedback<br/>
</li>
</ul>
<ul>
<li id="sec-3-1-1-4">(tests are optionals)<br/>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Data as Data</h3>
<div class="outline-text-3" id="text-3-2">


</div>

<div id="outline-container-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> a list is a list</h4>
<div class="outline-text-4" id="text-3-2-1">

</div>

</div>

<div id="outline-container-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> if object need be, why not a map?</h4>
<div class="outline-text-4" id="text-3-2-2">

</div>

</div>

<div id="outline-container-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> unicity? set?</h4>
<div class="outline-text-4" id="text-3-2-3">

</div>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> oh! and code is data</h3>
<div class="outline-text-3" id="text-3-3">

<p>Hakuna matata
</p>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-06-05 19:59:44 CEST</p>
<p class="author">Author: Antoine R. Dumont</p>
<p class="creator">Org version 7.8.09 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
